app/views/sessions/login.html.erb

<h1> Log In </h1>
<%= User.first.username %>
---
SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT 1