app/controllers/games_controller.rb

  def create
    @game = Game.new(game_params)
    @game.save
---
INSERT INTO "games" ("title", "date", "city", "state", "zip", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def search
    @games = Game.all
---
SELECT "games".* FROM "games"